uhnp/src/AccumulationRegisters/РасчетыПоФинансовымИнструментам/РасчетыПоФинансовымИнструментам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыПоФинансовымИнструментам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>Оплачивается</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипГрафика</name>
    <type>
      <types>EnumRef.ТипыГрафиковФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяАналитики</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаХозяйственнойОперации</name>
    <type>
      <types>CatalogRef.НастройкиХозяйственныхОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторФинЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
    <type>
      <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>АналитикаУчетаПоПартнерам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоПартнерам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКредитовИДепозитов</types>
      <types>CatalogRef.ДоговорыАренды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСуммы</name>
    <type>
      <types>EnumRef.ТипыСуммГрафикаКредитовИДепозитов</types>
      <types>EnumRef.ТипыПлатежейПоАренде</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйДокумент</name>
    <type>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПервичныйДокумент</types>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

uhnp/src/Enums/ЭлементыСтруктурыЗадолженности/ЭлементыСтруктурыЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭлементыСтруктурыЗадолженности</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссии</name>
  </enumValues>
  <enumValues>
    <name>Штрафы</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеКомиссии</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимость</name>
  </enumValues>
  <enumValues>
    <name>ВыкупнаяСтоимостьАванс</name>
  </enumValues>
  <enumValues>
    <name>ОбеспечительныйПлатеж</name>
  </enumValues>
  <enumValues>
    <name>УслугаПоАренде</name>
  </enumValues>
  <enumValues>
    <name>ОсновнойДолгКонтрагента</name>
    <comment>Основной долг контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыКонтрагента</name>
    <comment>Проценты контрагента (используется для валютно-процентного свопа)</comment>
  </enumValues>
  <enumValues>
    <name>УслугаПоАрендеАванс</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВидыДвиженийПриходРасход/ВидыДвиженийПриходРасход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийПриходРасход</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ТипыСуммГрафикаКредитовИДепозитов/ТипыСуммГрафикаКредитовИДепозитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСуммГрафикаКредитовИДепозитов</name>
  <enumValues>
    <name>ОсновнойДолг</name>
  </enumValues>
  <enumValues>
    <name>Проценты</name>
  </enumValues>
  <enumValues>
    <name>Комиссия</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/тн_НачислениеПроцентовПоЗаймам/Module.bsl
// Климов Антон 10.11.2022 Выполнение задач №000043309
//
// Пересчитывает график начисления процентов и сумму процентов в графике платежей в зависимости от суммы погашения/выдачи основного долга
// и записывает график в текущую версию соглашения.                                                                   
// Используются движения по РН "Расчет по финансовым инструментам" документов ПоступлениеБезналичныхДенежныхСредств и СписаниеБезналичныхДенежныхСредств
Процедура тн_РасчетПоФинансовымИнструментамПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Регистратор = Источник.Отбор.Регистратор.Значение;
	ЭтоПоступлениеСписаниеБДС = (ТипЗнч(Регистратор) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") 
	// НАЧАЛО Белышев Игорь 11.01.2023 Выполнение задач №000043956 
	Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер")
	Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.РасходныйКассовыйОрдер")
	// КОНЕЦ Белышев Игорь 11.01.2023 Выполнение задач №000043956
	Или ТипЗнч(Регистратор) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств"));
	Если ЭтоПоступлениеСписаниеБДС Тогда
		Если Регистратор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВыдачаЗаймов
			// НАЧАЛО Белышев Игорь 11.01.2023 Выполнение задач №000043956 
			Или Регистратор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоКредитам 
			Или Регистратор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоКредитам 
			// КОНЕЦ Белышев Игорь 11.01.2023 Выполнение задач №000043956
			Или Регистратор.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствПоЗаймамВыданным Тогда
			
			РасшифровкаПлатежа = Регистратор.РасшифровкаПлатежа;
			// НАЧАЛО Борисенко Игорь 05.03.2024 Выполнение задач №000048730
			//Если НЕ РасшифровкаПлатежа.Количество() Тогда
			Если РасшифровкаПлатежа.Количество() = 0 Тогда
			// КОНЕЦ Борисенко Игорь 05.03.2024 Выполнение задач №000048730
				Возврат;
			КонецЕсли;
			// НАЧАЛО Борисенко Игорь 05.03.2024 Выполнение задач №000048730
			Если Не ЗначениеЗаполнено(РасшифровкаПлатежа[0].ДоговорКредитаДепозита) Тогда
				Возврат;
			КонецЕсли;
			// КОНЕЦ Борисенко Игорь 05.03.2024 Выполнение задач №000048730
			ВерсияСоглашенияСсылка = РасшифровкаПлатежа[0].ДоговорКредитаДепозита.ВерсияСоглашения;
			// НАЧАЛО Борисенко Игорь 05.03.2024 Выполнение задач №000048730
			Если Не ОбщегоНазначения.СсылкаСуществует(ВерсияСоглашенияСсылка) Тогда
				Возврат;
			КонецЕсли;
			// КОНЕЦ Борисенко Игорь 05.03.2024 Выполнение задач №000048730
			ВерсияСоглашенияОбъект = ВерсияСоглашенияСсылка.ПолучитьОбъект();
			МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ВерсияСоглашенияСсылка.Метаданные().ПолноеИмя());
			ОписаниеГрафика = МенеджерОбъекта.ОписаниеГрафика(ВерсияСоглашенияСсылка.ДоговорКонтрагента.ВидДоговораУХ);
			ОперацииГрафика = РаботаСДоговорамиКонтрагентовУХ.ОперацииГрафика(ОписаниеГрафика, ВерсияСоглашенияОбъект);
			ОбъектРасчетов = ВерсияСоглашенияОбъект.ДоговорКонтрагента;
			
			// НАЧАЛО Белоконенко Денис 17.04.2023 Выполнение задач №000043956
			//ТаблицаФакт = ПолучитьТаблицуФакт(ВерсияСоглашенияСсылка, Регистратор.Дата); 
			ДатаОкончанияДействия = ВерсияСоглашенияСсылка.ДатаОкончанияДействия;
			Если ЗначениеЗаполнено(ДатаОкончанияДействия) Тогда
				ДатаПолученияФакта = ДатаОкончанияДействия;
			Иначе
				ДатаПолученияФакта = Дата(3999, 1, 1); // все данные	
			КонецЕсли;
			ТаблицаФакт = ПолучитьТаблицуФакт(ВерсияСоглашенияСсылка, ДатаПолученияФакта);
			// КОНЕЦ Белоконенко Денис 17.04.2023 Выполнение задач №000043956
			ВерсияСоглашенияОбъект.ГрафикРасчетов.Очистить();
			ВерсияСоглашенияОбъект.Проценты.Очистить();
			СуммаОстаткаОбязательств = ВерсияСоглашенияОбъект.Сумма;
			РабочаяТаблицаГрафика = ВерсияСоглашенияОбъект.ГрафикРасчетов;
			// НАЧАЛО Белышев Игорь 11.01.2023 Выполнение задач №000043956 
			//ОперацияПриход = ОперацииГрафика[ОписаниеГрафика["ОсновнойДолг"].КолонкаПриходОперация];
			//РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, СуммаОстаткаОбязательств, ВерсияСоглашенияОбъект.ДатаНачалаДействия,,ОперацияПриход);
			// КОНЕЦ Белышев Игорь 11.01.2023 Выполнение задач №000043956 
			Для Каждого СтрокаФакт Из ТаблицаФакт Цикл
				// НАЧАЛО Климов Антон 07.09.2023 Выполнение задач №000046779
				//РабочаяТаблицаГрафика = ВерсияСоглашенияОбъект.ГрафикРасчетов;
				//Если СтрокаФакт.КолонкаСекции = Перечисления.ВидыДвиженийПриходРасход.Расход Тогда
				//	ОперацияРасход = ОперацииГрафика[ОписаниеГрафика["ОсновнойДолг"].КолонкаРасходОперация];
				//	РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, СтрокаФакт.Сумма,	СтрокаФакт.Дата,,ОперацияРасход); 
				//	СуммаОстаткаОбязательств = СуммаОстаткаОбязательств - СтрокаФакт.Сумма;
				//ИначеЕсли СтрокаФакт.КолонкаСекции = Перечисления.ВидыДвиженийПриходРасход.Приход Тогда
				//	ОперацияПриход = ОперацииГрафика[ОписаниеГрафика["ОсновнойДолг"].КолонкаПриходОперация];
				//	РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, СтрокаФакт.Сумма,	СтрокаФакт.Дата,,ОперацияПриход);
				//	СуммаостаткаОбязательств = СуммаОстаткаОбязательств + СтрокаФакт.Сумма;
				//КонецЕсли;
				Операция = ОперацииГрафика[ОписаниеГрафика["ОсновнойДолг"]["Колонка"+СтрокаФакт.КолонкаСекции+"Операция"]];
				РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, СтрокаФакт.Сумма,	СтрокаФакт.Дата,,Операция); 
				СуммаОстаткаОбязательств = СуммаОстаткаОбязательств - СтрокаФакт.Сумма;
				// КОНЕЦ  Климов Антон 07.09.2023 Выполнение задач №000046779
			КонецЦикла;
			// НАЧАЛО Белышев Игорь 11.01.2023 Выполнение задач №000043956 
			//ОперацияРасход = ОперацииГрафика[ОписаниеГрафика["ОсновнойДолг"].КолонкаРасходОперация];
			//РаботаСДоговорамиКонтрагентовУХ.ДобавитьПозициюВГрафик(РабочаяТаблицаГрафика, СуммаОстаткаОбязательств,	ВерсияСоглашенияОбъект.ДатаОкончанияДействия,,ОперацияРасход);
			// КОНЕЦ Белышев Игорь 11.01.2023 Выполнение задач №000043956 
			
			ПересчитатьГрафик(ВерсияСоглашенияОбъект, ОписаниеГрафика, ОперацииГрафика, Отказ); 
			ВерсияСоглашенияОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Климов Антон 10.11.2022 Выполнение задач №000043309
Функция ПолучитьТаблицуФакт(ОбъектРасчетов, Дата) Экспорт

	Если Не ЗначениеЗаполнено(ОбъектРасчетов) Тогда		
		ТаблицаФакт = Новый ТаблицаЗначений;
		Возврат ТаблицаФакт;		
	КонецЕсли;
	
	ТаблицаФакт = ПолучитьФактРасчетыПоДоговору(ОбъектРасчетов, Дата); 
	Возврат ТаблицаФакт;

КонецФункции

// Климов Антон 10.11.2022 Выполнение задач №000043309
Функция ТаблицаОписанияГрафика(ОписаниеГрафика, ОперацииГрафика)
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяСекции", 						Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(200))); // ОсновнойДолгПолучение, ОсновнойДолгВозврат
	Таблица.Колонки.Добавить("КолонкаСекции", 					Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвиженийПриходРасход")); // Приход, Расход
	Таблица.Колонки.Добавить("ЭлементСтруктурыЗадолженности", 	Новый ОписаниеТипов("ПеречислениеСсылка.ЭлементыСтруктурыЗадолженности")); // ОсновнойДолг
	Таблица.Колонки.Добавить("Операция", 						Новый ОписаниеТипов("СправочникСсылка.ОперацииГрафиковДоговоров"));
	Таблица.Колонки.Добавить("ВидБюджета", 						Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ВидыБюджетов"));
	Таблица.Колонки.Добавить("НаправлениеВзаиморасчетов", 		Новый ОписаниеТипов("ПеречислениеСсылка.ВидыДвиженийПриходРасход")); // вид движения в регистр РасчетыСКонтрагентамиГрафики
	
	МассивКолонок = Новый Массив;
	МассивКолонок.Добавить("КолонкаПриход");
	МассивКолонок.Добавить("КолонкаРасход");
	
	Для каждого СекцияГрафика Из ОписаниеГрафика Цикл
		
		ПараметрыСекции = СекцияГрафика.Значение;
		Для каждого ИмяКолонки Из МассивКолонок Цикл
			
			Операция = ПараметрыСекции[ИмяКолонки + "Операция"];
			ПараметрыОперации = ОперацииГрафика.Получить(Операция);
			
			Строка = Таблица.Добавить();
			Строка.ИмяСекции 						= ПараметрыСекции[ИмяКолонки]; // ОсновнойДолгПолучение
			Строка.ЭлементСтруктурыЗадолженности 	= ПараметрыСекции.ЭлементСтруктурыЗадолженности; // ОсновнойДолг
			Строка.Операция 						= Операция; // КредитПолученный_ОсновнойДолгПолучение		 
			Строка.КолонкаСекции 					= ПараметрыОперации.КолонкаСекции; // Приход
			Строка.НаправлениеВзаиморасчетов 		= ПараметрыОперации.НаправлениеВзаиморасчетов; // Расход - рост задолженности
			Строка.ВидБюджета 						= ПараметрыОперации.ВидБюджета;	 
			
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

// Климов Антон 10.11.2022 Выполнение задач №000043309
Процедура ПересчитатьГрафик(ВерсияСоглашенияОбъект, ОписаниеГрафика, ОперацииГрафика, Отказ)
	
	СтруктураДействий = Новый Структура;                    
	МассивСекций = Новый Массив;
	МассивСекций.Добавить("Проценты");
	СекцииГрафика = Новый Структура;
	СекцииГрафика.Вставить("СекцииГрафика", МассивСекций);
	СтруктураДействий.Вставить("Пересчитать", СекцииГрафика);
	ФинансовыеИнструментыУХ.ПересчетГрафика(ВерсияСоглашенияОбъект,0,ОписаниеГрафика, ОперацииГрафика, СтруктураДействий, Отказ);
	
КонецПроцедуры

// Климов Антон 10.11.2022 Выполнение задач №000043309
Функция ПолучитьФактРасчетыПоДоговору(ВерсияСоглашения, Дата)

	Запрос = Новый Запрос;
	// НАЧАЛО Климов Антон 07.09.2023 Выполнение задач №000046779
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//               |	ВЫБОР
	//               |		КОГДА РасчетыПоФинансовымИнструментамОбороты.СуммаОборот < 0
	//               |			ТОГДА -РасчетыПоФинансовымИнструментамОбороты.СуммаОборот
	//               |		ИНАЧЕ РасчетыПоФинансовымИнструментамОбороты.СуммаОборот
	//               |	КОНЕЦ КАК Сумма,
	//               |	НАЧАЛОПЕРИОДА(РасчетыПоФинансовымИнструментамОбороты.Период, ДЕНЬ) КАК Дата,
	//               |	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг) КАК ЭлементСтруктурыЗадолженности,
	//               |	ВЫБОР
	//               |		КОГДА РасчетыПоФинансовымИнструментамОбороты.СуммаОборот > 0
	//			   // НАЧАЛО Белышев Игорь 11.01.2023 Выполнение задач №000043956 
	//			   //|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	//			   //|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	//			   |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	//			   |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	//			   // НАЧАЛО Белышев Игорь 11.01.2023 Выполнение задач №000043956 
	//               |	КОНЕЦ КАК КолонкаСекции
	//               |ИЗ
	//               |	РегистрНакопления.РасчетыПоФинансовымИнструментам.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, Договор = &Договор) КАК РасчетыПоФинансовымИнструментамОбороты
	//               |ГДЕ
	//               |	РасчетыПоФинансовымИнструментамОбороты.ТипСуммы = &ТипСуммы
	//               |	И РасчетыПоФинансовымИнструментамОбороты.СуммаОборот <> 0";
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА РасчетыПоФинансовымИнструментамОбороты.СуммаОборот < 0
	|			ТОГДА -РасчетыПоФинансовымИнструментамОбороты.СуммаОборот
	|		ИНАЧЕ РасчетыПоФинансовымИнструментамОбороты.СуммаОборот
	|	КОНЕЦ КАК Сумма,
	|	НАЧАЛОПЕРИОДА(РасчетыПоФинансовымИнструментамОбороты.Период, ДЕНЬ) КАК Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ЭлементыСтруктурыЗадолженности.ОсновнойДолг) КАК ЭлементСтруктурыЗадолженности,
	|	РасчетыПоФинансовымИнструментамОбороты.Регистратор КАК Регистратор,
	|	РасчетыПоФинансовымИнструментамОбороты.Договор.ВидДоговораУХ КАК ДоговорВидДоговораУХ,
	|	ВЫБОР
	|		КОГДА РасчетыПоФинансовымИнструментамОбороты.Договор.ВидДоговораУХ = ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.ЗаемВыданный)
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыПоФинансовымИнструментамОбороты.СуммаОборот > 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				КОНЕЦ
	|		КОГДА РасчетыПоФинансовымИнструментамОбороты.Договор.ВидДоговораУХ = ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.ЗаемПолученный)
	|				ИЛИ РасчетыПоФинансовымИнструментамОбороты.Договор.ВидДоговораУХ = ЗНАЧЕНИЕ(Справочник.ВидыДоговоровКонтрагентовУХ.Кредит)
	|			ТОГДА ВЫБОР
	|					КОГДА РасчетыПоФинансовымИнструментамОбороты.СуммаОборот < 0
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Приход)
	|					ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДвиженийПриходРасход.Расход)
	|				КОНЕЦ
	|	КОНЕЦ КАК КолонкаСекции
	|ИЗ
	|	РегистрНакопления.РасчетыПоФинансовымИнструментам.Обороты(&НачалоПериода, &ОкончаниеПериода, Регистратор, Договор = &Договор) КАК РасчетыПоФинансовымИнструментамОбороты
	|ГДЕ
	|	РасчетыПоФинансовымИнструментамОбороты.ТипСуммы = &ТипСуммы
	|	И РасчетыПоФинансовымИнструментамОбороты.СуммаОборот <> 0";
	// КОНЕЦ  Климов Антон 07.09.2023 Выполнение задач №000046779
	Запрос.УстановитьПараметр("Договор", ВерсияСоглашения.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(ВерсияСоглашения.ДатаНачалаДействия));
	Если ВерсияСоглашения.ДатаОкончанияДействия = Дата('00010101') Тогда
		ДатаОкончания = Дата;
	ИначеЕсли ВерсияСоглашения.ДатаОкончанияДействия>=КонецДня(Дата) Тогда
		ДатаОкончания = Дата;
	Иначе
		ДатаОкончания = ВерсияСоглашения.ДатаОкончанияДействия;
	КонецЕсли;
	Запрос.УстановитьПараметр("ОкончаниеПериода", КонецДня(Дата));
	Запрос.УстановитьПараметр("ТипСуммы", Перечисления.ТипыСуммГрафикаКредитовИДепозитов.ОсновнойДолг);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат

КонецФункции
